onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Д_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/Д_РаботаСФормамиВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Программно дополняет указанную форму дополнительными элементами и командами.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма, которую необходимо дополнить элементами управления
//
Процедура ДополнитьФорму(Форма) Экспорт
	
	//Начало.Коваленко: добавляем элементы и команды на открываемую форму
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьГруппаСкидкаПересчитать(Форма);
		ДобавитьПолеСогласованнаяCкидкаВГруппаСкидкаПересчитать(Форма);
		ДобавитьКомандаПересчитатьТаблицуВГруппаСкидкаПересчитать(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	//Конец.Коваленко
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	//Начало.Коваленко: Добавляем элемент в коллекцию элементов, выводим на форму в определенное место
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	//Конец.Коваленко
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)
	
	//Начало.Коваленко: Добавляем элемент в коллекцию элементов, выводим на форму в определенное место
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	//Конец.Коваленко

КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	//Начало.Коваленко: Добавляем элемент в коллекцию элементов, выводим на форму в определенное место
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	//Конец.Коваленко
	
КонецПроцедуры

Процедура ДобавитьГруппаСкидкаПересчитать(Форма)
	
	//Начало.Коваленко: Добавляем элемент в коллекцию элементов, выводим на форму в определенное место
	ГруппаСкидкаПересчитать = Форма.Элементы.Добавить("ГруппаСкидкаПересчитать", Тип("ГруппаФормы"), форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидкаПересчитать.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидкаПересчитать.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСкидкаПересчитать.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСкидкаПересчитать.ОтображатьЗаголовок = Ложь;
	ГруппаСкидкаПересчитать.РастягиватьПоГоризонтали = Ложь;
	//Конец.Коваленко
	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяCкидкаВГруппаСкидкаПересчитать(Форма)
	
	//Начало.Коваленко: Добавляем элемент в коллекцию элементов, выводим на форму в определенное место 
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяCкидка", Тип("ПолеФормы"), форма.Элементы.ГруппаСкидкаПересчитать);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "Д_СогласованнаяCкидкаПриИзменении")
	//Конец.Коваленко
	
КонецПроцедуры

Процедура ДобавитьКомандаПересчитатьТаблицуВГруппаСкидкаПересчитать(Форма)
	
	//Начало.Коваленко: Добавляем команду в коллекцию команд, выводим на форму в определенное место
	КомандаПересчитатьТаблицу = Форма.Команды.Добавить("ПересчитатьТаблицу");
	КомандаПересчитатьТаблицу.Заголовок = "Пересчитать Таблицу";
	КомандаПересчитатьТаблицу.Действие = "ПересчитатьТаблицу";
	
	КнопкаКоманды = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), форма.Элементы.ГруппаСкидкаПересчитать);
	КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаКоманды.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаКоманды.Картинка = БиблиотекаКартинок.Перечитать;
	//Конец.Коваленко
	
КонецПроцедуры

#КонецОбласти
